{
    "notes": {
        "ignorepls" : [
            "This json file stores all the data about my projects.",
            "I'm trying to include as much data as possible",
            "featured is the projects that will be featured on the main homepage, the rest will be viewable on a separate projects page that i will be making in the future",
            "blogpost will be a url for a blog that i will be making in the future",
            "photos will be an array of urls to images of the project",
            "type is the type of the project, for example software-website software-commandline software-misc hardware-microcontroller hardware-misc",
            "projectlanguage is the (human) language that is used for the project, for example English or Indonesian",
            "language is the languange used to make the project, for example Javascript, HTML, PHP, CSS, Python etc",
            "the key for each project is unique and will be used as the slug in the future (so no spaces or weird symbols)",
            "also, everything will be written in human readable text (for example the date is just regular date format, and not using unix time or something like that)",
            "im doing this because apparently JSON doesnt have any comments support, kinda makes sense why it doesnt have it. but kinda annoying that is doesnt have it"
        ]
    },

    "featured":[
        "homepage",
        "covid-id"
    ],
    "projects":{
        "homepage": {
            "title": "This Website",
            "key": "homepage",
            "type": "software-website",
            "desc": {
                "en": "This website you are currently viewing is the latest version of my website. Made with very simple and minimalistic design and utilizing many modern frameworks like NextJS, ReactJS, and TailwindCSS. This website is deployed to Github Pages using Github Actions to allow dynamic content while keeping the cost at virtually zero",
                "id": "Website yang sedang anda lihat ini adalah versi terbaru dari website saya. Dibuat dengan desain yang sederhana dan minimalis dan juga menggunakan berbagai framework modern seperti NextJS, ReactJS, dan TailwindCSS. Website ini di-deploy pada Github Pages menggunakan Github Actions untuk membuat konten dinamis dengan biaya yang hampir nol"
            },
            "url": "https://misaalanshori.github.io",
            "githuburl": "https://github.com/misaalanshori/misaalanshori.github.io",
            "blogpost": "",
            "photos": [],
            "projectlanguage": "English",
            "languages": ["HTML", "Javascript"],
            "techused": ["NodeJS", "NextJS", "ReactJS", "TailwindCSS", "Github Pages", "Github Actions"],
            "tags": ["website","web development","nodejs","nextjs","reactjs", "tailwindcss", "about", "myself"],
            "datecreated": "6 November 2021",
            "dateadded": "9 November 2021"
        },
        "covid-id": {
            "title": "Covid-ID",
            "key": "covid-id",
            "type": "software-website",
            "desc": {
                "en": "Covid-ID is a website that shows some statistics about the Covid-19 pandemic. The original version of this website was written in pure PHP and used a combination of APIs and web scraping, it was poorly written which has caused it to break. This new version is made using the same modern frameworks and technology as my homepage and uses the official API from the Indonesian Goverment, which means it looks much better and also a lot more stable.",
                "id": "Covid-ID adalah sebuah website yang menampilkan beberapa statistik mengenai pandemi Covid-19. Versi pertama dari website ini dibuat dengan PHP murni dan menggunakan kombinasi API dan juga webscraping, versi lama ini tidak dibuat dengan baik dan menyebabkannya untuk rusak. Versi baru ini dibuat dengan framework dan teknologi modern yang sama dengan homepage saya dan menggunakan API resmi dari pemerintah Indonesia, sehingga terlihat lebih bagus dan jauh lebih stabil"
            },
            "url": "https://misaalanshori.github.io/covid-id",
            "githuburl": "https://github.com/misaalanshori/misaalanshori.github.io",
            "blogpost": "",
            "photos": [],
            "projectlanguage": "Indonesian",
            "languages": ["HTML", "Javascript"],
            "techused": ["NodeJS", "NextJS", "ReactJS", "TailwindCSS", "Github Pages", "Github Actions"],
            "tags": ["website","web development","nodejs","nextjs","reactjs", "tailwindcss", "covid", "health", "API"],
            "datecreated": "8 November 2021",
            "dateadded": "9 November 2021"
        }
    }
}